Reports/АнализПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>АнализПравДоступа</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Права</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПрава</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВнешнийНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Права</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПрава</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/АнализПравДоступа/Forms/Тонкая/Ext/Form/Module.bsl
// Крылович С.Н. 2012-03-08 trim_@mail.ru анализ доступных ролей пользователей конфигурации информационной базы (тонкая форма, управляемое приложение)

&НаСервере
Перем кореньВнешниеДанные;
Перем основнойМакет;

&НаСервере
Процедура получитьДоступныеРолиПользователей(узел)
	
	корень = узел.Строки.Добавить();
	корень.имя = "Пользователи";
	корень.представление = "Пользователи базы";
	
	Для каждого текПользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		пользователь = корень.Строки.Добавить();
		пользователь.имя = текПользователь.Имя;
		пользователь.представление = текПользователь.ПолноеИмя;
		
		Для каждого текРоль Из текПользователь.Роли Цикл
			добавитьСтрокуВДерево(пользователь, текРоль.Имя, текРоль.Синоним);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура получитьРоли()
	
 	Роли = РеквизитФормыВЗначение("ЭлементРоли");

	Роли.Строки.Очистить();
	
	корень = добавитьСтрокуВДерево(Роли, "корень", "Текущая информационная база");
	
	узелРоли = добавитьСтрокуВДерево(корень, "Роли", "Роли");
	добавитьЭлементыМетаданных(узелРоли, "Роли");
	
	получитьДоступныеРолиПользователей(корень);
	
	ЗначениеВРеквизитФормы(Роли, "ЭлементРоли");

КонецПроцедуры

&НаСервере
Процедура получитьОсновныеОбъекты()
	
 	ОсновныеОбъекты = РеквизитФормыВЗначение("ЭлементыОсновныеОбъекты");

	ОсновныеОбъекты.Строки.Очистить();
	
	корень = добавитьСтрокуВДерево(ОсновныеОбъекты, "корень", "Объекты конфигурации");
	
	узелКонстанты = добавитьСтрокуВДерево(корень, "Константы", "Константы");
	добавитьЭлементыМетаданных(узелКонстанты, "Константы");
	
	узелСправочники = добавитьСтрокуВДерево(корень, "ОбщиеФормы", "Общие формы");
	добавитьЭлементыМетаданных(узелСправочники, "ОбщиеФормы");
	
	узелСправочники = добавитьСтрокуВДерево(корень, "Интерфейсы", "Интерфейсы", Истина);
	добавитьЭлементыМетаданных(узелСправочники, "Интерфейсы", Истина);
	
	узелСправочники = добавитьСтрокуВДерево(корень, "Справочники", "Справочники", Истина);
	добавитьЭлементыМетаданных(узелСправочники, "Справочники", Истина);
	
	узелДокументы = добавитьСтрокуВДерево(корень, "Документы", "Документы");
	добавитьЭлементыМетаданных(узелДокументы, "Документы");
	
	узелЖурналыДокументов = добавитьСтрокуВДерево(корень, "ЖурналыДокументов", "Журналы документов", Истина);
	добавитьЭлементыМетаданных(узелЖурналыДокументов, "ЖурналыДокументов", Истина);
	
	узелОтчеты = добавитьСтрокуВДерево(корень, "Отчеты", "Отчеты", Истина);
	добавитьЭлементыМетаданных(узелОтчеты, "Отчеты", Истина);
	
	узелОбработки = добавитьСтрокуВДерево(корень, "Обработки", "Обработки", Истина);
	добавитьЭлементыМетаданных(узелОбработки, "Обработки", Истина);
	
	узелПланыСчетов = добавитьСтрокуВДерево(корень, "ПланыСчетов", "Планы счетов");
	добавитьЭлементыМетаданных(узелПланыСчетов, "ПланыСчетов");
	
	узелПланыВидовРасчета = добавитьСтрокуВДерево(корень, "ПланыВидовРасчета", "Планы видов расчета");
	добавитьЭлементыМетаданных(узелПланыВидовРасчета, "ПланыВидовРасчета");
	
	узелРегистрыСведений = добавитьСтрокуВДерево(корень, "РегистрыСведений", "Регистры сведений");
	добавитьЭлементыМетаданных(узелРегистрыСведений, "РегистрыСведений");
	
	узелРегистрыНакопления = добавитьСтрокуВДерево(корень, "РегистрыНакопления", "Регистры накопления");
	добавитьЭлементыМетаданных(узелРегистрыНакопления, "РегистрыНакопления");
	
	узелРегистрыБухгалтерии = добавитьСтрокуВДерево(корень, "РегистрыБухгалтерии", "Регистры бухгалтерии");
	добавитьЭлементыМетаданных(узелРегистрыБухгалтерии, "РегистрыБухгалтерии");
	
	узелРегистрыРасчета = добавитьСтрокуВДерево(корень, "РегистрыРасчета", "Регистры расчета");
	добавитьЭлементыМетаданных(узелРегистрыРасчета, "РегистрыРасчета");
	
	узелПланыСчетов = добавитьСтрокуВДерево(корень, "ПланыОбмена", "Планы обмена", Истина);
	добавитьЭлементыМетаданных(узелПланыСчетов, "ПланыОбмена", Истина);
	
	ЗначениеВРеквизитФормы(ОсновныеОбъекты, "ЭлементыОсновныеОбъекты");
	
КонецПроцедуры

Процедура добавитьЭлементыМетаданных(узел, типОбъекта, Пометка = Ложь)

	Попытка
		коллекция = Метаданные[типОбъекта];
		Для Каждого видОбъекта Из коллекция Цикл
			добавитьСтрокуВДерево(узел, видОбъекта.Имя, видОбъекта.Синоним, Пометка);
		КонецЦикла;
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры 


Функция  добавитьСтрокуВДерево(узел, имя, представление, пометка = Ложь)

	стрУзла = узел.Строки.Добавить();
	
	стрУзла.имя = имя;
	стрУзла.представление = представление;
	стрУзла.пометка = пометка;
	
	Возврат стрУзла;

КонецФункции


Процедура заполнитьОбщийСписокОбъектовДляОтчета(спОбщий, узел)
	
	Для каждого текОбъект Из узел.Строки Цикл
		Если текОбъект.Пометка Тогда
			спОбщий.Добавить(текОбъект.Имя);
		КонецЕсли;
		
		заполнитьОбщийСписокОбъектовДляОтчета(спОбщий, текОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДействияФормыДействиеПометитьВсе(Кнопка)
	установитьСнятьПометки(ЭтаФорма.ТекущийЭлемент, Истина);
КонецПроцедуры

Процедура установитьСнятьПометки(элементФормы, признак)
	
	Если ТипЗнч(элементФормы) = Тип("ПолеСписка") Тогда
		спФормы = элементФормы.Значение;
		Для каждого текЭлемент Из спФормы Цикл
	 		текЭлемент.Пометка = признак;
	 	КонецЦикла;
	ИначеЕсли ТипЗнч(элементФормы) = Тип("ТабличноеПоле") Тогда
		установитьПометкиВДереве(элементФормы.Значение, признак);
	КонецЕсли;
	
КонецПроцедуры // установитьСнятьПометки()

Процедура установитьПометкиВДереве(узел, признак)

	Для каждого текОбъект Из узел.Строки Цикл
		текОбъект.Пометка = признак;
		
		установитьПометкиВДереве(текОбъект, признак);
	КонецЦикла;

КонецПроцедуры

Процедура ДействияФормыДействиеСнятьПометки(Кнопка)
	установитьСнятьПометки(ЭтаФорма.ТекущийЭлемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура установитьСнятьПометкиПодчиненным(узел, Пометка = Неопределено)
	
	Для Каждого элемент Из узел.ПолучитьЭлементы() Цикл
		Если Пометка = Неопределено Тогда
			элемент.Пометка = не элемент.Пометка;
		Иначе
			элемент.Пометка = Пометка;
		КонецЕсли;
		установитьСнятьПометкиПодчиненным(элемент, Пометка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДействияФормыДействиеСохранитьДанныеОтчета(Кнопка)
	
 //   табДокумент = Новый ТабличныйДокумент;
 //   
 //   Макет = ПолучитьМакет("Макет");
 //   запись = Макет.ПолучитьОбласть("Запись");
 //   
 //   Для каждого стрДанных Из Отчет.Данные Цикл
 //   	ЗаполнитьЗначенияСвойств(запись.Параметры, стрДанных);
 //   	
 //		табДокумент.Вывести(запись);
 //
 //   КонецЦикла;
 //   
 //   выборСохраняемогоФайла = Новый  ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
 //   выборСохраняемогоФайла.Фильтр = "(Табличный документ (*.mxl)|*.mxl|Все файлы (*.*)|*.*";
 //   Если выборСохраняемогоФайла.Выбрать() Тогда 
 //   	ПолноеИмяФайла = выборСохраняемогоФайла.ПолноеИмяФайла;
 //   	
 //   	Если не ЗначениеЗаполнено(выборСохраняемогоФайла.Расширение) Тогда
 //   		ПолноеИмяФайла = ПолноеИмяФайла + ".mxl";
 //   	КонецЕсли;
 //   	
 //   	табДокумент.Записать(ПолноеИмяФайла);
 //   КонецЕсли;
	
КонецПроцедуры

&Клиент
Процедура ДействияФормыДействиеЗагрузитьДанныеОтчета(Кнопка)
	
	//табДокумент = Новый ТабличныйДокумент;
	//
	//выборСохраняемогоФайла = Новый  ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//выборСохраняемогоФайла.Фильтр = "(Табличный документ (*.mxl)|*.mxl|Все файлы (*.*)|*.*";
	//Если выборСохраняемогоФайла.Выбрать() Тогда 
	//	ПолноеИмяФайла = выборСохраняемогоФайла.ПолноеИмяФайла;
	//	
	//	табДокумент.Прочитать(ПолноеИмяФайла);
	//	
	//	Для индСтрок = 1 По табДокумент.ВысотаТаблицы Цикл
	//		новаяСтрока = Отчет.ВнешнийНабор.Добавить();
	//		
	//		новаяСтрока.Роль = табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C1").Текст;
	//		новаяСтрока.ОбъектИмя = табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C2").Текст;
	//		новаяСтрока.ОбъектПредставление = табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C3").Текст;
	//		новаяСтрока.ОбъектТип = табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C4").Текст;
	//		новаяСтрока.Права = табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C5").Текст;
	//		новаяСтрока.НаличиеПрава = ?(табДокумент.Область("R" + Формат(индСтрок, "ЧГ=") + "C6").Текст = "Да", Истина, Ложь);
	//	КонецЦикла;
	//	
	//	заполнитьДеревоРолиКонфигурации();
	//	табДокумент.Показать();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыОчиститьВнешнийНабор(Кнопка)
	ПоказатьВопрос(Новый ОписаниеОповещения("ДействияФормыОчиститьВнешнийНаборПослеВопроса", ЭтотОбъект), "Очистить внешний набор данных?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыОчиститьВнешнийНаборПослеВопроса(ответ, ДопПараметры) Экспорт
	Если ответ = КодВозвратаДиалога.Да Тогда
		Отчет.ВнешнийНабор.Очистить();
		
		заполнитьДеревоРолиКонфигурации();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура заполнитьДеревоРолиКонфигурации()
	
	Если не ЗначениеЗаполнено(кореньВнешниеДанные) Тогда
		кореньВнешниеДанные = добавитьСтрокуВДерево(Отчет.дрРоли, "кореньВнешниеДанные", "Внешние данные");
	Иначе
		кореньВнешниеДанные.Строки.Очистить();
	КонецЕсли;
	
	тРоли = Отчет.ВнешнийНабор.Выгрузить();
	тРоли.Свернуть("Роль","");
	
	Для каждого роль Из тРоли Цикл
		рольИмя = "внешняя" + роль.роль;
		найденнаяСтрока = кореньВнешниеДанные.строки.Найти(рольИмя, "Имя");
		Если найденнаяСтрока = Неопределено Тогда
	 		добавитьСтрокуВДерево(кореньВнешниеДанные, рольИмя, роль.роль, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДействияФормыДействияОтличия(Кнопка)
	
	Результат = Элементы.Результат;
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	колонки = Результат.ШиринаТаблицы;
	
	массивВсехПравВозможных = получитьМассивВсехПрав();
	
	индСтрок = 4;
	Пока индСтрок < Результат.ВысотаТаблицы Цикл
		возможноеПраво = Результат.Область("R" + Формат(индСтрок, "ЧГ=") + "C1").Текст;
		
		перейтиНаСледующуюСтроку = Истина;
		
		Если не массивВсехПравВозможных.Найти(возможноеПраво) = Неопределено Тогда
			следующаяОбласть = Ложь;
			
			первоеЗначение = Результат.Область("R" + Формат(индСтрок, "ЧГ=") + "C2").Текст;
			Для инд = 3 По колонки Цикл
				текущееЗначение = Результат.Область("R" + Формат(индСтрок, "ЧГ=") + "C" + Формат(инд, "ЧГ=")).Текст;
				Если не первоеЗначение = текущееЗначение Тогда
					следующаяОбласть = Истина;
					Прервать;
				КонецЕсли;	
				первоеЗначение = текущееЗначение;
			КонецЦикла;
			
			Если не следующаяОбласть Тогда // удаляем область если в ней все значения равны
				строкаДокумента = Результат.Область("R" + Формат(индСтрок, "ЧГ="));
				Результат.УдалитьОбласть(строкаДокумента, Смещать);
				
				перейтиНаСледующуюСтроку = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Если перейтиНаСледующуюСтроку Тогда 
			индСтрок = индСтрок + 1;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция получитьМассивВсехПрав() Экспорт
	
	массивПрав = Новый Массив;
	
	//типОбъекта="Константы"
	//типОбъекта="РегистрыСведений"
	//типОбъекта="РегистрыРасчета"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("Редактирование");
	//типОбъекта="Справочники" 
	//типОбъекта="ПланыСчетов" 
	//типОбъекта="ПланыВидовРасчета"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Добавление");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Удаление");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("ИнтерактивноеДобавление");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("ИнтерактивноеУдаление");
		массивПрав.Добавить("ИнтерактивнаяПометкаУдаления");
		массивПрав.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
		массивПрав.Добавить("ИнтерактивноеУдалениеПомеченных");
		массивПрав.Добавить("ВводПоСтроке");
	//типОбъекта="Документы"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Добавление");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Удаление");
		массивПрав.Добавить("Проведение");
		массивПрав.Добавить("ОтменаПроведения");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("ИнтерактивноеДобавление");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("ИнтерактивноеУдаление");
		массивПрав.Добавить("ИнтерактивнаяПометкаУдаления");
		массивПрав.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
		массивПрав.Добавить("ИнтерактивноеУдалениеПомеченных");
		массивПрав.Добавить("ИнтерактивноеПроведение");
		массивПрав.Добавить("ИнтерактивноеПроведениеНеОперативное");
		массивПрав.Добавить("ИнтерактивнаяОтменаПроведения");
		массивПрав.Добавить("ИнтерактивноеИзменениеПроведенных");
		массивПрав.Добавить("ВводПоСтроке");
	//типОбъекта="ЖурналыДокументов"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Просмотр");
	//типОбъекта="Отчеты" или
	//типОбъекта="Обработки"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Использование");
	//типОбъекта="РегистрыНакопления" или
	//типОбъекта="РегистрыБухгалтерии"
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("УправлениеИтогами");
	
	Возврат массивПрав;
			
КонецФункции // ПолучитьСписокПрав()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	получитьОсновныеОбъекты();
	получитьРоли();
КонецПроцедуры

&НаСервере
Процедура дополнитьВнешнимиДанными(Данные, ВнешнийНабор) 
	
	Если не кореньВнешниеДанные = Неопределено Тогда
		мВнешниеРоли = Новый Массив;
		
		Отбор = Новый Структура("Пометка", 1);

		НайденныеСтроки = кореньВнешниеДанные.Строки.НайтиСтроки(Отбор, Истина);
		
		Для каждого стрДерева Из НайденныеСтроки Цикл
	 		мВнешниеРоли.Добавить(стрДерева.Представление);
	 	КонецЦикла;
		
	  //  Для каждого стрДерева Из кореньВнешниеДанные.Строки Цикл
	  //  	Если стрДерева.Пометка Тогда
	  //		мВнешниеРоли.Добавить(стрДерева.Представление);
	  //  	КонецЕсли;
	  //КонецЦикла;
		
		Для каждого стрДанных Из ВнешнийНабор Цикл
			роль = стрДанных.Роль;
			Если не мВнешниеРоли.Найти(роль) = Неопределено Тогда
		 		новаяСтрока = Данные.Добавить();
				ЗаполнитьЗначенияСвойств(новаяСтрока, стрДанных);
				новаяСтрока.Роль = Роль + " (внешняя)";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура заполнитьВнешнийНаборДанных(древоРоли, древоОсновныеОбъекты, тДанные) Экспорт
	
	тДанные.Очистить();
	
	корень = древоРоли.Строки.Найти("корень", "имя");
	
	Если не корень = Неопределено Тогда
		получитьИсходныеДанные(корень, древоОсновныеОбъекты, тДанные);
	КонецЕсли;

КонецПроцедуры

Процедура получитьИсходныеДанные(узелРоли, древоОсновныеОбъекты, тДанные)
	
	Для каждого роль Из узелРоли.Строки Цикл
		Если роль.Пометка Тогда
			видОбъекта = роль.имя;
			типОбъекта = роль.Родитель.имя;
			
			Если не (типОбъекта = "Пользователи" или типОбъекта = "Роли") Тогда
				типОбъекта = "Роли";
			КонецЕсли;
			
			Попытка
				объектМетаданных = Метаданные[типОбъекта][видОбъекта];
			Исключение
				получитьИсходныеДанные(роль, древоОсновныеОбъекты, тДанные);
				Продолжить;
			КонецПопытки;
			
			получитьОбъектыИзДерева(древоОсновныеОбъекты, объектМетаданных, тДанные);
		КонецЕсли;
		
		получитьИсходныеДанные(роль, древоОсновныеОбъекты, тДанные);
	КонецЦикла;
	
КонецПроцедуры


Процедура получитьОбъектыИзДерева(узел, роль, тДанные)

	Отбор = Новый Структура("Пометка", 1);
	
	строки = узел.Строки.НайтиСтроки(Отбор, Истина);
	
	Для каждого текущийОбъект Из строки Цикл
		типОбъекта = текущийОбъект.Родитель.Имя;
		видОбъекта = текущийОбъект.Имя;
		представлениеОбъекта = текущийОбъект.представление;
		
		Попытка
			объектМетаданных = Метаданные[типОбъекта][видОбъекта];
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого типПрава Из получитьМассивПрав(типОбъекта) Цикл
			Попытка
				запись = тДанные.Добавить();
				запись.ОбъектТип = типОбъекта;
				запись.ОбъектИмя = видОбъекта;
				запись.ОбъектПредставление = представлениеОбъекта;
				запись.Роль = роль.Синоним;
				запись.Права = типПрава;
				запись.НаличиеПрава = ПравоДоступа(типПрава, объектМетаданных, роль);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура добавитьОбъектыИзДерева(узел, роль, тДанные)

	Для каждого текущийОбъект Из узел.Строки Цикл
		Если текущийОбъект.Пометка Тогда
			
			Если текущийОбъект.Родитель = Неопределено Тогда
				добавитьОбъектыИзДерева(текущийОбъект, роль, тДанные);
				Продолжить;
			КонецЕсли;
			
			типОбъекта = текущийОбъект.Родитель.Имя;
			видОбъекта = текущийОбъект.Имя;
			представлениеОбъекта = текущийОбъект.представление;
			
			Попытка
				объектМетаданных = Метаданные[типОбъекта][видОбъекта];
			Исключение
				добавитьОбъектыИзДерева(текущийОбъект, роль, тДанные);
				Продолжить;
			КонецПопытки;
			
			Для Каждого типПрава Из получитьМассивПрав(типОбъекта) Цикл
				Попытка
					запись = тДанные.Добавить();
					запись.ОбъектТип = типОбъекта;
					запись.ОбъектИмя = видОбъекта;
					запись.ОбъектПредставление = представлениеОбъекта;
					запись.Роль = роль.Синоним;
					запись.Права = типПрава;
					запись.НаличиеПрава = ПравоДоступа(типПрава, объектМетаданных, роль);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;
			
		КонецЕсли;
		
		добавитьОбъектыИзДерева(текущийОбъект, роль, тДанные);
	КонецЦикла;

КонецПроцедуры

Функция получитьМассивПрав(типОбъекта) Экспорт
	
	массивПрав = Новый Массив;
	
	Если типОбъекта="Константы" или
		 типОбъекта="РегистрыСведений" или
		 типОбъекта="РегистрыРасчета"
	Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("Редактирование");
	ИначеЕсли типОбъекта="Справочники" или
		 	  типОбъекта="ПланыСчетов" или
		 	  типОбъекта="ПланыВидовРасчета"
	Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Добавление");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Удаление");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("ИнтерактивноеДобавление");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("ИнтерактивноеУдаление");
		массивПрав.Добавить("ИнтерактивнаяПометкаУдаления");
		массивПрав.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
		массивПрав.Добавить("ИнтерактивноеУдалениеПомеченных");
		массивПрав.Добавить("ВводПоСтроке");
		
	ИначеЕсли типОбъекта="Документы" или типОбъекта="ПланыОбмена" Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Добавление");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Удаление");
		массивПрав.Добавить("Проведение");
		массивПрав.Добавить("ОтменаПроведения");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("ИнтерактивноеДобавление");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("ИнтерактивноеУдаление");
		массивПрав.Добавить("ИнтерактивнаяПометкаУдаления");
		массивПрав.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
		массивПрав.Добавить("ИнтерактивноеУдалениеПомеченных");
		массивПрав.Добавить("ИнтерактивноеПроведение");
		массивПрав.Добавить("ИнтерактивноеПроведениеНеОперативное");
		массивПрав.Добавить("ИнтерактивнаяОтменаПроведения");
		массивПрав.Добавить("ИнтерактивноеИзменениеПроведенных");
		массивПрав.Добавить("ВводПоСтроке");
	ИначеЕсли типОбъекта="ЖурналыДокументов" Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Просмотр");
	ИначеЕсли типОбъекта="Отчеты" или
		 	  типОбъекта="Обработки"
	Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Использование");
		
	ИначеЕсли типОбъекта="Интерфейсы" Тогда
		массивПрав.Добавить("Использование");
		
	ИначеЕсли типОбъекта="ОбщиеФормы" Тогда
		массивПрав.Добавить("Просмотр");
	ИначеЕсли типОбъекта="РегистрыНакопления" или
		 	  типОбъекта="РегистрыБухгалтерии"
	Тогда
		массивПрав.Добавить("Чтение");
		массивПрав.Добавить("Изменение");
		массивПрав.Добавить("Просмотр");
		массивПрав.Добавить("Редактирование");
		массивПрав.Добавить("УправлениеИтогами");
	КонецЕсли;
	
	Возврат массивПрав;
			
КонецФункции // ПолучитьСписокПрав()

&НаКлиенте
Процедура ЭлементРолипометкаПриИзменении(Элемент)
	установитьСнятьПометкиПодчиненным(Элементы.ЭлементРоли.ТекущиеДанные, Элементы.ЭлементРоли.ТекущиеДанные.Пометка);
КонецПроцедуры

&НаСервере
Функция заполнитьДанные()
	
	Роли = РеквизитФормыВЗначение("ЭлементРоли");
 	ОсновныеОбъекты = РеквизитФормыВЗначение("ЭлементыОсновныеОбъекты");
	
	тДанные = Отчет.Данные.Выгрузить();
	
	заполнитьВнешнийНаборДанных(Роли, ОсновныеОбъекты, тДанные);
	дополнитьВнешнимиДанными(тДанные, Отчет.ВнешнийНабор.Выгрузить());
	
	Отчет.Данные.Загрузить(тДанные);
	
	Возврат тДанные;
	
КонецФункции // заполнитьДанные()


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	вывестиОтчет();
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура вывестиОтчет()
	
	тДанные = заполнитьДанные();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.вывестиОтчет(тДанные, Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура ЭлементыОсновныеОбъектыпометкаПриИзменении(Элемент)
	установитьСнятьПометкиПодчиненным(Элементы.ЭлементыОсновныеОбъекты.ТекущиеДанные, Элементы.ЭлементыОсновныеОбъекты.ТекущиеДанные.Пометка);
КонецПроцедуры
